import React from 'react';

const Blogs = () => {
    return (
        <div>
            <div className=' border p-4 m-5'>
                <h1>Difference between javascript and nodejs</h1>
                <p> জাভাস্ক্রিপ্ট একটি প্রোগ্রামিং ভাষা। এটি একটি ব্রাউজার ইঞ্জিন সহ যেকোনো ওয়েব ব্রাউজারে চলছে। প্রধানত একটি  ওয়েব অ্যাপ্লিকেশনের জন্য ক্লায়েন্ট-সাইড ক্রিয়াকলাপের জন্য ব্যবহার করা, যেমন সম্ভাব্য বৈশিষ্ট্য যাচাইকরণ বা একটি নির্দিষ্ট ব্যবধানে পৃষ্ঠাটি রিফ্রেশ না করে ওয়েব পৃষ্ঠাগুলিতে কিছু গতিশীল পরিবর্তন সরবরাহ করা।  জাভাস্ত্রিপ্ট স্পাইডার মানকি (ফায়ারফক্স), জাভাস্ক্রিপ্ট কোর(সাফারি), ভি ৮(গুগল ক্রোম) এর মতো যেকোনো ইঞ্জিন চালায় </p>
                <p>এটি জাভাস্ক্রিপ্টের জন্য কিছু নির্দিষ্ট দরকারী লাইব্রেবি সহ একটি দোভাষী এবং পরিবেশ যা জাভাস্ত্রিপ্ট প্রোগ্রামিং আলাদাভাবে ব্যবহার করতে পারে। এটি প্রধানত কোন অপারেটিং সিস্টেমের অব্লকিং ক্রিয়াকলাপ অ্যাক্সেস বা সম্পাদনের জন্য ব্যবহৃহ হয়, যেমন শেল স্ক্রিপ্ট তৈরি বা চালানো বা কোনও ব্যাকএন্ড কাজ চালানো। নোড জেএস শুধুমাত্র একটি v8  ইঞ্জিনে চলে  যা মুলত গুগল ক্রোম দ্বারা ব্যবহৃত হয়। এবং জাভাস্ক্রিপ্ট প্রোগ্রাম যা এই নোড জেএস এর অধীনে লেখা হবে তা সবসময় V8 ইঞ্জিনে চালানো হবে।</p>
            </div>
            <div className=' border p-4 m-5'>
                <h1>When should you use nodejs and when should you use mongodb</h1>

                <p>MongoDB  হল ডকুমেন্ট ওরিয়েন্টেড ডেটাবেস। MongoDB JSON ফর্ম্যাটে প্রচুর ডেটা সঞ্চয় করে। MongoDB এর কর্মক্ষমতা যেকোনো RDBMS -এর থেকে অনেক দ্রুত। MONGODB  বড় স্কেল ডেটার সাথে কাজ করার জন্য ডিজাইন করা হয়েছে। MongoDB একাধিক সার্ভারে কাজ করতে পারে। MongoDB সহজেই বিপুল সংখ্যক অ্যাক্সেক অনুরোধ পরিচালনা করতে পারে। প্রোগ্রামিং এ ২ টি ডিজাইন প্যাটার্ন আছে। একটি অ্যাসিস্ক্রোনাস প্রোগ্রামিং এবং অন্যটি সিঙ্ক্রোনাস প্রোগ্রামিং। নোড জেএস ডিফল্টরূপে অ্যাসিঙ্ক্রোনাস প্যাটার্ন অনুসরণ করে। অর্থাৎ কোনো কাজ শেষ হওয়ার জন্য অপেক্ষা করে না। এর মধ্যে, NodeJS  আরেকটি কাজ শুরু করে। এজন্য আমরা nodeJS ব্যবহার করি। </p>
            </div>
            <div className=' border p-4 m-5'>
                <h1>Differences between sql and nosql databases.</h1>



                <p>একটি ডাটাবেস নির্বাচন করার ক্ষেত্রে সবচেয়ে বড় সিদ্ধান্ত হল একটি রিলেশনাল (SQL) বা নন- রিলেশনার (NoSQL) ডেটা স্ট্রাকচার বেছে নেওয়া। যদিও নেওয়ার সময় মনে রাখতে হবে। এসকিউএল ডেটাবেসগুলিকে প্রাথমিকভাবে রিলেশনাল ডেটাবেস (RDBMS) বলা হয়; যেখানে NoSQL ডাটাবেসকে প্রাথমিকভাবে অ-রিলেশনাল বা ডিস্ট্রিবিউটেড ডাটাবেস বলা হয়।SQL ডাটাবেস ডেটা ভিত্তিক স্ট্রাকচার্ড ক্যোয়ারী ল্যাঙ্গুয়েজ (SQL) সংজ্ঞায়িত করে এবং ম্যানিপুলেট করে। একদিক থেকে দেখলে এই ভাষা অত্যন্ত শক্তিশালী। SQL হল সবচেয়ে বহুমুখী এবং ব্যাপকভাবে ব্যবহৃত বিকল্পগুলির মধ্যে একটি যা এটিকে বিশেষ করে দুর্দান্ত জটিল প্রশ্নের জন্য একটি নিরাপদ পছন্দ করে তোলে। কিন্তু অন্য দিক থেকে এটি সীমাবদ্ধ হতে পারে। SQL এর সাথে কাজ করার আগে আপনার ডেটার গঠন নির্ধারণ করতে আপনাকে পূর্বনির্ধারিত স্কিমা ব্যবহার করতে হবে। এছাড়াও আপনার সমস্ত ডেটা অবশ্যই একই কাঠামো অনুসরণ করবে। এর জন্য গুরুত্বপূর্ণ আপ-ফ্রন্ট প্রস্তুতির প্রয়োজন হতে পারে যার অর্থ কাঠামোর পরিবর্তন আপনার পুরো সিস্টেমের জন্য উভয়ই কঠিন এবং বিঘ্নিত হবে।
                    একটি NoSQL ডাটাবেসে অসংগঠিত ডেটার জন্য গতিশীল স্কিমা রয়েছে। ডেটা বিভিন্ন উপায়ে সংরক্ষণ করা হয় যার অর্থ এটি নথি-ভিত্তিক, কলাম-ভিত্তিক, গ্রাফ-ভিত্তিক বা কীভ্যালু স্টোর হিসাবে সংগঠিত হতে পারে। এই নমনীয়তার অর্থ হল নথিগুলি প্রথমে সংজ্ঞায়িত কাঠামো ছাড়াই তৈরি করা যেতে পারে। এছাড়াও প্রতিটি নথির নিজস্ব অনন্য কাঠামো থাকতে পারে। সিনট্যাক্স ডাটাবেস থেকে ডাটাবেসে পরিবর্তিত হয় এবং আপনি যেতে যেতে ক্ষেত্র যোগ করতে পারেন।

                    প্রায় সব পরিস্থিতিতে SQL ডাটাবেস উল্লম্বভাবে মাপযোগ্য। এর মানে হল যে আপনি RAM, CPU বা SSD এর মতো জিনিসগুলি বাড়িয়ে একটি একক সার্ভারে লোড বাড়াতে পারেন। কিন্তু অন্যদিকে NoSQL ডাটাবেস অনুভূমিকভাবে মাপযোগ্য। এর মানে হল যে আপনি আপনার NoSQL ডাটাবেসে শার্ডিং বা আরও সার্ভার যোগ করে আরও ট্র্যাফিক পরিচালনা করেন। এটি একই বিল্ডিংয়ে আরও মেঝে যোগ করার মতো বনাম আশেপাশে আরও বিল্ডিং যুক্ত করার মতো। এইভাবে NoSQL শেষ পর্যন্ত বৃহত্তর এবং আরও শক্তিশালী হয়ে উঠতে পারে, এই ডাটাবেসগুলিকে বৃহৎ বা সর্বদা পরিবর্তনশীল ডেটা সেটগুলির জন্য পছন্দের পছন্দ করে তোলে।</p>
            </div>
        </div>
    );
};

export default Blogs;